<?php
//1000番台は入力フォームでのエラーメッセージ
const ERR1001 = "この値は必須です、入力してください。";
const ERR1002 = "数値で入力してください。";
const ERR1003 = "入力された値が大きすぎます。";
const ERR1004 = "正の値を入力してください。";
const ERR1005 = "整数を入力してください。";
const ERR1006 = "有効な値を入力してください。";

//1100番台はデータベース関連のエラーメッセージ
const ERR1101 = "データベースに接続できませんでした。";
const ERR1102 = "データの追加に失敗しました。";
const ERR1103 = "データの削除に失敗しました。";
const ERR1104 = "データの更新に失敗しました。";
const ERR1105 = "データの取得に失敗しました。";

//1200番台はファイル送信時のエラーメッセージ
const ERR1201 = "選択したファイルのサイズが大きすぎます。";
const ERR1202 = "ファイルアップロードに失敗しました。";
const ERR1203 = "対応していない形式のファイルです。";
const ERR1204 = "ファイルダウンロードに失敗しました。";

//2000番台はエラー時の対処法
const ERR2001 = "環境を確認していただくか、少し時間をおいてから再度お試しください。";
const ERR2002 = "申し訳ありませんが最初からやり直してください。";
const ERR2003 = "画像ファイル（JPG,PNG,GIF）を選択してください。";

//404
const ERR404 = "お探しのページは見つかりませんでした。存在しないページか、すでに削除されたページを参照しようとしているようです。";
?>